of_coupling/of-original/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  RAS;

RAS
{
    model           LaunderSharmaKE;

    turbulence      on;

    printCoeffs     on;
}
